#### ClipPlane Members

---

|  |
| --- |
| ClipPlane Class   Constructors   Methods   Properties   See Also |

The  ClipPlane  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ClipPlane | Constructs a copy of the clip plane. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ClipPlane |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Normal | The plane's normal vector. |
| Public property | Origin | The plane's origin. |

# See Also

ClipPlane Class

Autodesk.Revit.DB.DirectContext3D Namespace